Autodesk.Revit.DB.Structure.FabricAreaType.CreateDefaultFabricAreaType(Autodesk.Revit.DB.Document)
Creates a new FabricAreaType object with a default name.
aDoc:
The document.
Returns:
The newly created type id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015